#!/usr/bin/env python
# coding: utf-8

# In[ ]:


import pandas as pd


# In[ ]:


df1=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20170101_20171231.csv")
df2=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20180101_20180701.csv")
df3=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20180701_20180715.csv")
df4=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20180715_20181231.csv")
df5=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20181231_20190101.csv")
df6=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20190101_20190301.csv")
df7=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20190301_20190601.csv")
df8=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20190601_20190901.csv")
df9=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20190901_20200101.csv")
df10=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20200101_20200401.csv")
df11=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20200401_20200501.csv")
df12=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20200501_20200701.csv")
df13=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20200701_20200801.csv")
df14=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20200801_20200901.csv")
df15=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20200901_20201001.csv")
df16=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20201001_20201101.csv")
df17=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20201101_20201201.csv")
df18=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20201201_20201231.csv")
df19=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210101_20210115.csv")
df20=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210116_20210131.csv")
df21=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210201_20210215.csv")
df22=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210216_20210228.csv")
df23=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210301_20210315.csv")
df24=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210316_20210331.csv")
df25=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210401_20210415.csv")
df26=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210416_20210430.csv")
df27=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210501_20210515.csv")
df28=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210516_20210531.csv")
df29=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210601_20210615.csv")
df30=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210616_20210630.csv")
df31=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210701_20210715.csv")
df32=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210716_20210731.csv")
df33=pd.read_csv("빅카인즈-밀키트_크롤링\\밀키트_20210801_20210808.csv")


# In[ ]:


#데이터 합치기
df=pd.concat((df1,df2,df3,df4,df5,df6,df7,df8,df9,df10,df11,df12,df13,df14,df15,df16,df17,df18,df19,df20,df21,df22,df23,df24,df25,df26,df27,df28,df29,df30,df31,df32,df33),axis=0)
df.head()


# In[ ]:


df.to_csv("크롤링 결과.csv",encoding="utf-8-sig")


# In[ ]:




